NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_sysctrl_peripherals.h
/*

Copyright (c) 2010 - 2026, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF54H20_SYSCTRL_PERIPHERALS_H
#define NRF54H20_SYSCTRL_PERIPHERALS_H

#ifdef __cplusplus
    extern "C" {
#endif

#include <stdbool.h>
/*HSFLL*/
#define HSFLL_PRESENT 1
#define HSFLL_COUNT 1

#define HSFLL200_DITHER_32B 1                        /*!< (unspecified)                                                        */
#define HSFLL200_CLOCKCTRL_INTEGER_DIVISION 0        /*!< (unspecified)                                                        */

/*MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists. Each transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and they contain data buffer information, address pointers, buffer sizes and data type attributes.*/

#define MVDMA_PRESENT 1
#define MVDMA_COUNT 2

#define MVDMA110_COMPLETED_EVENT 1                   /*!< (unspecified)                                                        */
#define MVDMA110_DPPI_DISCONNECTED 0                 /*!< (unspecified)                                                        */
#define MVDMA110_INSTANCE_IN_WRAPPER 0               /*!< (unspecified)                                                        */
#define MVDMA110_MVDMA_JOBLISTCNT_MIN 0              /*!< Number of MVDMA job lists : 0..3                                     */
#define MVDMA110_MVDMA_JOBLISTCNT_MAX 3              /*!< Number of MVDMA job lists : 0..3                                     */
#define MVDMA110_MVDMA_JOBLISTCNT_SIZE 4             /*!< Number of MVDMA job lists : 0..3                                     */

#define MVDMA120_COMPLETED_EVENT 1                   /*!< (unspecified)                                                        */
#define MVDMA120_DPPI_DISCONNECTED 1                 /*!< (unspecified)                                                        */
#define MVDMA120_INSTANCE_IN_WRAPPER 1               /*!< (unspecified)                                                        */
#define MVDMA120_MVDMA_JOBLISTCNT_MIN 0              /*!< Number of MVDMA job lists : 0..3                                     */
#define MVDMA120_MVDMA_JOBLISTCNT_MAX 3              /*!< Number of MVDMA job lists : 0..3                                     */
#define MVDMA120_MVDMA_JOBLISTCNT_SIZE 4             /*!< Number of MVDMA job lists : 0..3                                     */

/*PPIB registers*/
#define PPIB_PRESENT 1
#define PPIB_COUNT 11

#define PPIB110_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB110_NTASKSEVENTS_MAX 3                   /*!< (unspecified)                                                        */
#define PPIB110_NTASKSEVENTS_SIZE 4                  /*!< (unspecified)                                                        */

#define PPIB120_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB120_NTASKSEVENTS_MAX 3                   /*!< (unspecified)                                                        */
#define PPIB120_NTASKSEVENTS_SIZE 4                  /*!< (unspecified)                                                        */

#define PPIB121_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB121_NTASKSEVENTS_MAX 7                   /*!< (unspecified)                                                        */
#define PPIB121_NTASKSEVENTS_SIZE 8                  /*!< (unspecified)                                                        */

#define PPIB130_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB130_NTASKSEVENTS_MAX 31                  /*!< (unspecified)                                                        */
#define PPIB130_NTASKSEVENTS_SIZE 32                 /*!< (unspecified)                                                        */

#define PPIB131_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB131_NTASKSEVENTS_MAX 23                  /*!< (unspecified)                                                        */
#define PPIB131_NTASKSEVENTS_SIZE 24                 /*!< (unspecified)                                                        */

#define PPIB132_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB132_NTASKSEVENTS_MAX 7                   /*!< (unspecified)                                                        */
#define PPIB132_NTASKSEVENTS_SIZE 8                  /*!< (unspecified)                                                        */

#define PPIB133_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB133_NTASKSEVENTS_MAX 7                   /*!< (unspecified)                                                        */
#define PPIB133_NTASKSEVENTS_SIZE 8                  /*!< (unspecified)                                                        */

#define PPIB134_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB134_NTASKSEVENTS_MAX 7                   /*!< (unspecified)                                                        */
#define PPIB134_NTASKSEVENTS_SIZE 8                  /*!< (unspecified)                                                        */

#define PPIB135_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB135_NTASKSEVENTS_MAX 7                   /*!< (unspecified)                                                        */
#define PPIB135_NTASKSEVENTS_SIZE 8                  /*!< (unspecified)                                                        */

#define PPIB136_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB136_NTASKSEVENTS_MAX 7                   /*!< (unspecified)                                                        */
#define PPIB136_NTASKSEVENTS_SIZE 8                  /*!< (unspecified)                                                        */

